from datetime import time


SUBJECT_ABBREVIATION_MAP = {
    "哲学": "哲学",
    "文": "文学",
    "芸術": "芸術",
    "心理学": "心理学",
    "文化人類学": "文化人類学",
    "ジェンダー": "ジェンダーとセクシュアリティ",
    "生命倫理": "生命倫理学",
    "地球環境": "地球環境論",
    "化学": "化学",
    "生物学": "生物学",
    "生活環境": "生活環境論",
    "人間工学": "人間工学",
    "日本国憲法": "日本国憲法と人権",
    "人間と歴史": "人間と歴史",
    "教育学": "教育学",
    "社会学": "社会学",
    "人間関係": "人間関係論",
    "国際社会": "国際社会の動向",
    "スポーツ": "スポーツと健康",
    "英語I": "英語I",
    "英語II": "英語II",
    "英語III": "英語III",
    "中国語": "中国語",
    "ドイツ語": "ドイツ語",
    "トータルコミュ": "トータルコミュニケーション",
    "情報リテ": "情報リテラシー",
    "統計学": "統計学",
    "基礎ゼミI": "基礎ゼミナールI",
    "基礎ゼミII": "基礎ゼミナールII",
    "関係法規": "関係法規",
    "社会保障": "社会保障論",
    "公衆衛生": "公衆衛生学",
    "疫学保健": "疫学・保健統計",
    "ヘルスプロモーション": "ヘルスプロモーション論",
    "保健福祉": "保健医療福祉行政論",
    "学校保健": "学校保健と産業保健",
    "チーム医療": "チーム医療論",
    "人間発達": "人間発達論",
    "臨床心理学": "臨床心理学",
    "生化学": "生化学",
    "遺伝学": "遺伝学",
    "栄養学": "栄養学",
    "人体構造I": "人体の構造I",
    "人体構造II": "人体の構造II",
    "人体機能I": "人体の機能I",
    "人体機能II": "人体の機能II",
    "微生物学": "微生物学",
    "病理学": "病理学",
    "病態I": "病態治療学I",
    "病態II": "病態治療学II",
    "病態III": "病態治療学III",
    "薬理学": "薬理学",
    "生体情報": "生体情報と看護",
    "放射線": "放射線と看護",
    "東洋医学": "東洋医学と経絡",
    "音楽療法": "音楽療法",
    "看護原論": "看護学原論",
    "看護理論": "看護理論",
    "看護倫理": "看護倫理",
    "日常援助": "日常生活援助論",
    "診断援助": "診断－治療援助論",
    "過程展開": "看護過程展開論",
    "基礎実習I": "基礎看護学実習I",
    "基礎看護学実習II": "基礎看護学実習II",
    "実践": "実践看護学概論",
    "フィジカル": "フィジカルアセスメント",
    "地域診断": "地域診断",
    "母性支援": "母性看護支援論",
    "小児支援": "小児看護支援論",
    "成人支援": "成人看護支援論",
    "高齢支援": "高齢者看護支援論",
    "メンタル支援": "メンタルヘルス看護支援論",
    "家族支援": "家族看護支援論",
    "公衆支援": "公衆衛生看護支援論",
    "急性期援助": "急性期看護援助論",
    "慢性期援助": "慢性期看護援助論",
    "リハビリ援助": "リハビリテーション看護援助論",
    "終末期援助": "終末期看護援助論",
    "がん援助": "がん看護援助論",
    "在宅援助": "在宅看護援助論",
    "精神援助": "精神看護援助論",
    "公衆方法": "公衆衛生看護方法論",
    "公衆展開論": "公衆衛生看護活動展開論",
    "実践演習I": "実践看護学演習I",
    "実践演習II": "実践看護学演習II",
    "国際看護": "国際看護学",
    "災害看護": "災害看護学",
    "看護管理": "看護管理",
    "公衆管理": "公衆衛生看護管理",
    "専門職論": "看護専門職論",
    "総合実習": "総合実習",
    "研究方法": "看護研究方法論",
    "卒業研究": "卒業研究",
}


DEFAULT_GRADE_ROOM_MAP = {
    1: "N202",
    2: "N206",
    3: "N308",
    4: "N102",
}


SLOT_START_TIME_MAP = {
    1: time(hour=9, minute=0),
    2: time(hour=10, minute=40),
    3: time(hour=13, minute=0),
    4: time(hour=14, minute=40),
    5: time(hour=16, minute=20),
    6: time(hour=18, minute=0),
}


PARSE_TARGET_SHEET_REGEX = r"^\d{4}-[1-4]編?-(前|後)$"
ROOM_INFO_REGEX = r"^\(.*\)$"
GROUP_INFO_REGEX = r"^[A-D]{1,4}$"
YEAR_REGEX = r"\d{4}"
MONTH_REGEX = r"\d{1,2}月"
TRANSFERED_GRADE_REGEX = r"^[1-4]編$"


SOURCE_SHEET_START_ROW = 1


DEFAULT_NORMALIZE_FORM = "NFKC"
DEFAULT_TIMEZONE = "Asia/Tokyo"
DEFAULT_LECTURE_PERIOD = 90  # minutes
